test/performance/results/2025-04-15/localhost-large-autonomi-http.txt
$ cat src/localhost-large-autonomi-http.js; k6 run -u 10 -i 1000 src/localhost-large-autonomi-http.js
import http from 'k6/http';

export default function () {
  http.get('http://localhost:8080/91d16e58e9164bccd29a8fd8d25218a61d8253b51c26119791b2633ff4f6b309/to-autonomi.mp4', { timeout: '600s' });
  http.get('http://localhost:8080/cec7a9eb2c644b9a5de58bbcdf2e893db9f0b2acd7fc563fc849e19d1f6bd872/st-patrick-monument.mp4', { timeout: '600s' });
  http.get('http://localhost:8080/b6ec9f0f84cf6236dc42d3624679649f51024a57a58b2805552bb3aa690244dd/newcastle-promenade.mp4', { timeout: '600s' });
}

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/

     execution: local
        script: src/localhost-large-autonomi-http.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1000 iterations shared among 10 VUs (maxDuration: 10m0s, gracefulStop: 30s)


     data_received..................: 17 GB 26 MB/s
     data_sent......................: 58 kB 92 B/s
     dropped_iterations.............: 880   1.396748/s
     http_req_blocked...............: avg=31.73µs  min=1.95µs   med=9.27µs   max=1.02ms   p(90)=28.55µs p(95)=49.7µs
     http_req_connecting............: avg=5.39µs   min=0s       med=0s       max=370.67µs p(90)=0s      p(95)=0s
     http_req_duration..............: avg=17.95s   min=1.61s    med=18.23s   max=33.83s   p(90)=32.15s  p(95)=33.12s
       { expected_response:true }...: avg=17.95s   min=1.61s    med=18.23s   max=33.83s   p(90)=32.15s  p(95)=33.12s
     http_req_failed................: 0.00% 0 out of 340
     http_req_receiving.............: avg=17.06s   min=1.03s    med=17.4s    max=33.56s   p(90)=30.83s  p(95)=32.94s
     http_req_sending...............: avg=227.85µs min=6.34µs   med=28.81µs  max=18.9ms   p(90)=94.78µs p(95)=160.61µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=883.64ms min=113.67ms med=713.15ms max=5.77s    p(90)=1.41s   p(95)=1.83s
     http_reqs......................: 340   0.539653/s
     iteration_duration.............: avg=52.51s   min=43.71s   med=53.67s   max=59.35s   p(90)=58.26s  p(95)=59.33s
     iterations.....................: 110   0.174594/s
     vus............................: 10    min=10       max=10
     vus_max........................: 10    min=10       max=10


running (10m30.0s), 00/10 VUs, 110 complete and 10 interrupted iterations
default ✗ [===>----------------------------------] 10 VUs  10m30.0s/10m0s  0110/1000 shared iters